import jieba.analyse
from collections import Counter

# sentence = jieba.load_userdict("daodejing.txt")
sentence = "道可道，非常道。名可名，非常名。无名天地之始。有名万物之母。故常无欲以观其妙。常有欲以观其徼。此两者同出而异名，同谓之玄。玄之又玄，众妙之门。" \
           "天下皆知美之为美，斯恶矣；皆知善之为善，斯不善已。故有无相生，难易相成，长短相形，高下相" \
           "倾，音声相和，前後相随。是以圣人处无为之事，行不言之教。万物作焉而不辞。生而不有，为而不恃，" \
           "功成而弗居。夫唯弗居，是以不去。" \
           "不尚贤， 使民不争。不贵难得之货，使民不为盗。不见可欲，使民心不乱。是以圣人之治，虚其心，" \
           "实其腹，弱其志，强其骨；常使民无知、无欲，使夫智者不敢为也。为无为，则无不治。" \
           "道冲而用之，或不盈。渊兮似万物之宗。解其纷，和其光，同其尘，湛兮似或存。吾不知谁之子，象帝之先。" \
           "天地不仁，以万物为刍狗。圣人不仁，以百姓为刍狗。天地之间，其犹橐迭乎？虚而不屈，动而愈出" \
           "。多言数穷，不如守中。" \
           "谷神不死是谓玄牝。玄牝之门是谓天地根。绵绵若存，用之不勤。" \
           "天长地久。天地所以能长且久者，以其不自生，故能长生。是以圣人後其身而身先，外其身而身存。" \
           "非以其无私邪！故能成其私。" \
           "上善若水。水善利万物而不争，处众人之所恶，故几於道。居善地，心善渊，与善仁，言善信，正善" \
           "治，事善能，动善时。夫唯不争，故无尤。" \
           "持而盈之不如其己；揣而锐之不可长保；金玉满堂莫之能守；富贵而骄，自遗其咎。功遂身退，天之道。" \
           "载营魄抱一，能无离乎？专气致柔，能如婴儿乎？涤除玄览，能无疵乎？爱国治民，能无为乎？天门" \
           "开阖，能为雌乎？明白四达，能无知乎。"

"""
1 sentence：待提取的文本语料；
2 topK：返回 TF/IDF 权重最大的关键词个数，默认值为 20；
3 withWeight：是否需要返回关键词权重值，默认值为 False；
4 allowPOS：仅包括指定词性的词，默认值为空，即不筛选
"""
kw = " ".join(jieba.analyse.extract_tags(sentence, topK=5, withWeight=False, allowPOS=()))
print(kw)  # 万物 天地 圣人 无为 不争
print("&" * 65)

# 列出出现次数最多的5个元素及其计数，按降序依次排列。如果元素为None，则列出所有元素计数
top_5 = Counter(sentence).most_common(5)
print(top_5)  # [('，', 55), ('。', 41), ('不', 27), ('之', 23), ('其', 17)]
print("&" * 65)

# 只获取Top5的关键字，并修改一下词性，只选择名词n和动词v.（使用的是tf-idf算法）
kw_1 = jieba.analyse.extract_tags(sentence, topK=5, withWeight=True, allowPOS=(['n', 'v']))
print(kw_1)
# [('万物', 0.5169565596206667),
# ('天地', 0.48024289362066663),
# ('圣人', 0.44180834956320003),
# ('不争', 0.3548095892232),
# ('刍狗', 0.341388409688)]
